[
    {
        "nom": "Réaliser",
        "couleur": "#B80805",
        "résumé": "La compétence \"Réaliser\" consiste à développer des solutions informatiques pour répondre aux besoins d’un client. Cela inclut la conception, le codage, les tests et l’intégration d’applications informatiques. Les objectifs clés sont de respecter les exigences du client, d’appliquer les principes algorithmiques, de garantir la qualité du code et de choisir des ressources techniques adaptées. Cette compétence se décline en plusieurs niveaux d’apprentissage, allant de la création d’applications simples à la réalisation d’applications complètes et leur adaptation à différents supports (web, mobile, IoT). Elle implique aussi la maintenance et l’évolution d’applications existantes.",
        "description": "Introduction\n-------------\nLa compétence \"Réaliser\" est fondamentale dans le cursus du BUT Informatique. Elle prépare les étudiants à concevoir, développer, tester et maintenir des solutions informatiques de qualité adaptées aux besoins des clients et aux contraintes techniques.\n\nNiveaux d’apprentissage\n------------------------\nNiveau 1 : Développement d’applications simples\n  - Implémenter des conceptions simples.\n  - Élaborer des conceptions basiques pour des applications.\n  - Tester et valider les résultats en fonction des spécifications fournies.\n  - Développer des interfaces utilisateurs.\n\nNiveau 2 : Applications complètes\n  - Créer des spécifications fonctionnelles et non fonctionnelles à partir des besoins client.\n  - Appliquer des principes d’accessibilité et d’ergonomie dans leurs applications.\n  - Suivre de bonnes pratiques en matière de conception et de programmation.\n  - Effectuer des tests rigoureux pour valider la qualité des applications.\n\nNiveau 3 : Applications sur des supports variés\n  - Choisir et mettre en œuvre des architectures adaptées pour des applications complexes.\n  - Faire évoluer des applications existantes en fonction de nouveaux besoins.\n  - Intégrer les applications dans des environnements de production variés (web, mobile, IoT, etc.).\n\nDomaines d’application\n-----------------------\nLes situations professionnelles associées incluent :\n1. La création d’applications informatiques nouvelles.\n2. La mise à jour et l’évolution d’applications existantes.\n3. La maintenance des solutions en conditions opérationnelles.\n\nImportance de la qualité\n-------------------------\nUn aspect central de cette compétence est la garantie de la qualité du code. Cela passe par une documentation rigoureuse, des tests approfondis, et le respect des principes algorithmiques.\n",
        "logo":"gg:dice-1"
    },
    {
        "nom": "Optimiser",
        "couleur": "#ED8C51",
        "résumé": "La compétence \"Optimiser\" vise à concevoir des applications informatiques performantes en respectant des critères comme le temps d'exécution, la précision, et la consommation de ressources. Elle repose sur la formalisation et la modélisation de situations complexes, l’utilisation d’algorithmes et de structures de données appropriés, et la validation des choix réalisés. Les étudiants apprennent à améliorer les performances des programmes, réduire leur impact environnemental, et développer des solutions adaptées à des contextes spécifiques. Cette compétence est essentielle pour analyser, comparer, et optimiser les algorithmes, tout en tenant compte des enjeux sociétaux et environnementaux.",
        "description": "Introduction\n-------------\nLa compétence \"Optimiser\" forme les étudiants à développer des solutions informatiques efficaces, en équilibrant performance, précision et impact environnemental. Elle repose sur des méthodes analytiques et des outils algorithmiques avancés.\n\nNiveaux d’apprentissage\n------------------------\nNiveau 1 : Appréhender et construire des algorithmes\n  - Analyser un problème avec méthode (découpage en éléments algorithmiques simples, structure de données...).\n  - Comparer des algorithmes pour des problèmes classiques (tris simples, recherche...).\n  - Formaliser et utiliser des outils mathématiques pour résoudre des problèmes en informatique.\n\nNiveau 2 : Sélectionner les algorithmes adéquats pour répondre à un problème donné\n  - Choisir des structures de données complexes adaptées au problème.\n  - Utiliser des techniques algorithmiques avancées (par ex. recherche opérationnelle, optimisation globale, IA...).\n  - Comprendre les enjeux de sécurisation des données et du code.\n  - Évaluer l’impact environnemental et sociétal des solutions proposées.\n\nNiveau 3 : Analyser et optimiser des applications\n  - Anticiper les résultats de métriques (temps d’exécution, occupation mémoire, montée en charge...).\n  - Profiler et analyser le comportement d’un code existant.\n  - Utiliser des bibliothèques et méthodes spécifiques au domaine d'application (imagerie, intelligence artificielle, jeux vidéos, parallélisme...).\n\nDomaines d’application\n-----------------------\nLes situations professionnelles associées incluent :\n1. L’amélioration des performances des programmes dans des contextes contraints.\n2. La limitation de l’impact environnemental d’une application informatique.\n3. La mise en place d’applications informatiques adaptées et efficaces.\n\nImportance de l'optimisation\n----------------------------\nL’optimisation permet de garantir que les solutions informatiques répondent aux besoins tout en minimisant leur coût en ressources. Cela implique une compréhension approfondie des algorithmes, des structures de données, et des impacts globaux des choix réalisés.\n",
        "logo":"gg:dice-2"
    },
    {
        "nom": "Administrer",
        "couleur": "#EFBA11",
        "résumé": "La compétence \"Administrer\" consiste à installer, configurer, sécuriser et maintenir les infrastructures, services, et réseaux d’une organisation. Elle vise à garantir la continuité des activités et une qualité de service optimale tout en appliquant les normes et bonnes pratiques de sécurité. Les étudiants apprennent à déployer des architectures techniques, à améliorer les infrastructures existantes, et à sécuriser les services informatiques. Cette compétence englobe la gestion des systèmes d’exploitation, la configuration des réseaux d’entreprise, et la virtualisation des services, tout en intégrant des mesures pour assurer la sécurité et la pérennité des systèmes.",
        "description": "Introduction\n-------------\nLa compétence \"Administrer\" prépare les étudiants à gérer les infrastructures et systèmes informatiques d’une organisation. Elle comprend l’installation, la configuration, la sécurisation, et la maintenance des systèmes pour assurer leur bon fonctionnement.\n\nNiveaux d’apprentissage\n------------------------\nNiveau 1 : Installer et configurer un poste de travail\n  - Identifier les différents composants matériels et logiciels d’un système numérique.\n  - Utiliser les fonctionnalités de base d’un système multitâches / multiutilisateurs.\n  - Installer et configurer un système d’exploitation et des outils de développement.\n  - Configurer un poste de travail dans un réseau d’entreprise.\n\nNiveau 2 : Déployer des services dans une architecture réseau\n  - Concevoir et développer des applications communicantes.\n  - Utiliser des serveurs et services réseaux virtualisés.\n  - Sécuriser les services et données d’un système.\n\nSituations professionnelles\n---------------------------\n1. Déployer une nouvelle architecture technique.\n2. Améliorer une infrastructure existante.\n3. Sécuriser les applications et services.\n\nImportance de la sécurité et de la qualité de service\n-----------------------------------------------------\nL’administration des systèmes informatiques repose sur la mise en œuvre de bonnes pratiques de sécurité et d’optimisation des performances. Elle garantit la continuité des activités et offre une qualité de service optimale aux utilisateurs.\n",
        "logo":"gg:dice-3"
    },
    {
        "nom": "Gérer",
        "couleur": "#92BF4E",
        "résumé": "La compétence \"Gérer\" consiste à concevoir, gérer, administrer et exploiter les données d’une entreprise afin de fournir les informations nécessaires au pilotage stratégique. Cela inclut la mise en place de bases de données, leur optimisation, la sécurisation des données et leur exploitation pour faciliter la prise de décisions. Les étudiants apprennent à respecter les réglementations sur la protection des données, à utiliser des infrastructures adaptées (data centers, cloud), et à assurer la cohérence et la qualité des informations. Cette compétence couvre également l’analyse des données hétérogènes et leur visualisation.",
        "description": "Introduction\n-------------\nLa compétence \"Gérer\" permet aux étudiants de maîtriser la gestion des données d’une entreprise, depuis leur conception jusqu’à leur exploitation pour des prises de décisions stratégiques.\n\nNiveaux d’apprentissage\n------------------------\nNiveau 1 : Concevoir et mettre en place une base de données à partir d’un cahier des charges\n  - Mettre à jour et interroger une base de données relationnelle (en requêtes directes ou via une application).\n  - Visualiser des données.\n  - Concevoir une base de données relationnelle à partir d’un cahier des charges.\n\nNiveau 2 : Optimiser une base de données, interagir avec une application et assurer la sécurité\n  - Optimiser les modèles de données de l’entreprise.\n  - Assurer la sécurité des données (intégrité et confidentialité).\n  - Organiser la restitution des données via des outils de programmation et de visualisation.\n  - Manipuler des données hétérogènes.\n\nSituations professionnelles\n---------------------------\n1. Lancer un nouveau projet.\n2. Sécuriser des données.\n3. Exploiter des données pour la prise de décisions.\n\nRespect des réglementations et impact écologique\n-------------------------------------------------\nLa gestion des données doit respecter les réglementations en vigueur, telles que celles sur la protection des données personnelles et la vie privée. Les infrastructures de stockage, qu’il s’agisse de data centers ou de solutions cloud, doivent être gérées en tenant compte de leur impact écologique.\n\nImportance de la cohérence et de la qualité des données\n--------------------------------------------------------\nAssurer la cohérence et la qualité des données est essentiel pour fournir des informations fiables et adaptées aux besoins stratégiques des entreprises.\n",
        "logo":"gg:dice-4"
    },
    {
        "nom": "Conduire",
        "couleur": "#0A215E",
        "résumé": "La compétence \"Conduire\" vise à organiser et piloter des projets informatiques pour répondre aux besoins des utilisateurs tout en respectant les objectifs stratégiques de l’entreprise. Elle implique l’utilisation de méthodologies classiques ou agiles, une communication efficace avec les parties prenantes, et le respect des normes juridiques et éthiques. Les étudiants apprennent à identifier les besoins métiers, à formaliser ces besoins, à mettre en place des outils de gestion de projet, et à piloter l’évolution des systèmes d’information. Cette compétence valorise également une approche proactive et responsable pour garantir la réussite des projets.",
        "description": "Introduction\n-------------\nLa compétence \"Conduire\" prépare les étudiants à organiser, piloter et superviser des projets informatiques dans le respect des attentes des utilisateurs et des objectifs stratégiques de l’entreprise.\n\nNiveaux d’apprentissage\n------------------------\nNiveau 1 : Identifier les besoins métiers des clients et des utilisateurs\n  - Appréhender les besoins du client et de l'utilisateur.\n  - Mettre en place les outils de gestion de projet.\n  - Identifier les acteurs et les différentes phases d’un cycle de développement.\n\nNiveau 2 : Appliquer une démarche de suivi de projet en fonction des besoins métiers\n  - Identifier les processus présents dans une organisation pour améliorer les systèmes d’information.\n  - Formaliser les besoins du client et de l'utilisateur.\n  - Identifier les critères de faisabilité d’un projet informatique.\n  - Définir et mettre en œuvre une démarche de suivi de projet.\n\nSituations professionnelles\n---------------------------\n1. Lancer un nouveau projet.\n2. Piloter le maintien d’un projet en condition opérationnelle.\n3. Faire évoluer un système d’information.\n\nApproche méthodologique\n------------------------\nLa gestion de projet s’appuie sur l’utilisation de méthodologies adaptées (classiques ou agiles) pour structurer et suivre les différentes phases du projet. Elle met également l’accent sur la communication proactive et efficace avec les parties prenantes.\n\nImportance des valeurs éthiques et responsables\n-----------------------------------------------\nCette compétence sensibilise les étudiants à la gestion éthique et durable des projets, tout en respectant les normes juridiques et les bonnes pratiques interculturelles.\n",
        "logo":"gg:dice-5"
    },
    {
        "nom": "Collaborer",
        "couleur": "#2a1c13",
        "résumé": "La compétence \"Collaborer\" développe les aptitudes nécessaires pour travailler efficacement au sein d’une équipe informatique. Cela inclut la capacité à s’intégrer dans une équipe pluridisciplinaire, à accompagner les évolutions informatiques, à respecter les contraintes juridiques et à maintenir une communication collaborative. Les étudiants apprennent à comprendre les rôles et fonctions des membres de l’équipe, à organiser leur travail en synergie avec les autres, et à transmettre des informations efficacement. À terme, ils acquièrent les compétences pour manager une équipe, organiser une veille technologique et accompagner le changement informatique.",
        "description": "Introduction\n-------------\nLa compétence \"Collaborer\" forme les étudiants à travailler en équipe dans des environnements informatiques, en adoptant des approches collaboratives et en développant des compétences interpersonnelles clés.\n\nNiveaux d’apprentissage\n------------------------\nNiveau 1 : Identifier ses aptitudes pour travailler dans une équipe\n  - Appréhender l’écosystème numérique.\n  - Découvrir les aptitudes requises selon les différents secteurs informatiques.\n  - Identifier les statuts, fonctions, et rôles de chaque membre d’une équipe pluridisciplinaire.\n  - Acquérir les compétences interpersonnelles pour travailler en équipe.\n\nNiveau 2 : Situer son rôle et ses missions au sein d’une équipe informatique\n  - Comprendre la diversité, la structure, et la dimension de l’informatique dans une organisation (ESN, DSI, ...).\n  - Appliquer une démarche pour s’intégrer dans une équipe informatique.\n  - Mobiliser des compétences interpersonnelles pour collaborer efficacement.\n  - Rendre compte de son activité professionnelle.\n\nNiveau 3 : Manager une équipe informatique\n  - Organiser et partager une veille technologique et informationnelle.\n  - Identifier les enjeux de l’économie de l’innovation numérique.\n  - Guider la conduite du changement informatique dans une organisation.\n  - Accompagner le management de projet informatique.\n\nSituations professionnelles\n---------------------------\n1. Lancer un nouveau projet.\n2. Organiser son travail en relation avec celui de son équipe.\n3. Élaborer, gérer, et transmettre de l’information.\n\nApproche collaborative\n----------------------\nCette compétence met l’accent sur la communication collaborative et le respect des rôles et responsabilités de chacun. Elle valorise également la gestion proactive des projets informatiques.\n\nImportance des compétences interpersonnelles\n--------------------------------------------\nLe travail en équipe nécessite des aptitudes interpersonnelles pour créer un environnement harmonieux et productif. La compétence \"Collaborer\" aide à développer ces qualités essentielles.\n",
        "logo":"gg:dice-6"
    }
]
